# В этом задании тебе нужно будет создать конструктор героев для RPG. Что-то вроде того, что реализован в играх а-ля NWN.
# Задание, в первую очередь, направлено на закрепление темы наследования и интерфейсов.
# За типизацию тоже буду ебать мозг, так что типизируй правильно, никаких Any.
# Основные требования:
# 1. У героя есть аттрибуты (возьми из DnD). Аттрибуты дают модификаторы, как в DnD.
# 2. Расы дают дополнительные модификаторы к аттрибутам и дополнительные способности (можно любые)
# 3. Классы персонажей делают то же самое - модификаторы аттрибутов и доп. способности
# 4. Реализовать этапы построения можно инпутами.
# 5. Постарайся не бояться ошибиться, делай как тебе это представляется правильным.
# 6. Проверять работоспособность буду сам, не парься над тем, как показать,
#    что условная доп. способность, полученная от класса персонажа, работает и реализована правильно
